# 第 2 章 HBase 和 HBase Shell

## HBase 运行模式

您可以在一台计算机上运行 HBase 以用于开发和测试环境。 HBase 支持三种运行模式：独立，伪分布和分布式。分布式模式适用于由 HDFS 支持的完整集群，其中多个服务器运行 HBase 堆栈的不同组件，我们将在第 8 章“HBase 的体系结构”中介绍。

独立模式适用于单个计算机，其中所有组件都在单个 Java 虚拟机中运行，而本地文件系统用于存储而不是 HDFS。伪分布式模式在一台服务器上的不同 JVM 中运行每个 HBase 组件，它可以使用 HDFS 或本地文件系统。

![](img/00007.jpeg)提示：伪分布式模式是本地运行的一个很好的选择 - 您可以在组件之间实现生产方式的分离，但无需运行多台机器。

[这个 HBase 文档](http://hbase.apache.org/)涵盖了在本地安装和运行 HBase，所以我不会在这里复制它，但是在本地运行 HBase 的最简单方法是使用 Docker。 Docker Hub 上有一些 HBase 图像，包括我自己的一个，我已经建立了这个图像。

Docker 是一种应用程序容器技术。容器是一种快速，轻量级的计算单元，可让您在一台计算机上运行多个负载。容器在概念上类似于虚拟机，但在磁盘，CPU 和内存使用方面要轻得多。 Docker 可在 Linux，OS / X 和 Windows 机器上运行。你可以在这里获得安装说明[。 Docker Hub 是预先构建的图像的公共注册表，我的图像可以在](http://www.docker.com/)[这里找到](https://hub.docker.com/r/sixeyed/hbase-succinctly)。

## 在 Docker 容器中运行 HBase

使用 Docker 容器的优点是，您可以用很少的开销来启动和终止实例，而且您不必担心任何软件或服务与开发机器冲突。

图像 hbase-succinctly 是我专门为了配合本书而设置的图片，它设置了我们将要使用的服务。要使用该映像，请安装 Docker 并执行代码清单 5 中的命令：

代码清单 5：在 Docker 中运行 HBase

```
docker run -d -p 2181:2181 \
 -p 60010:60010 -p 60000:60000 \
 -p 60020:60020 -p 60030:60030 \
 -p 8080:8080 -p 8085:8085 \
 -p 9090:9090 -p 9095:9095 \
 --name hbase -h hbase \
 sixeyed/hbase-succinctly

```

泊坞窗 运行命令中的某些设置是可选的，但如果您想要与本书中的示例一起编码，则需要运行完整命令。如果您不熟悉 Docker，请执行以下命令：

· 从公共 Docker Hub 中的 sixeyed 存储库中拉出名为 hbase-succinctly 的图像

· 在本地运行容器中的图像，为服务器和 Web UI 公开所有关键端口

· 将图像命名为 hbase ，因此我们可以使用其他 Docker 命令控制它，而无需知道 Docker 将分配的容器 ID

· 为图像提供主机名 hbase ，因此我们可以使用该名称访问它

第一次运行时，需要一段时间才能将映像从注册表中提取到本地计算机，但是对于将来的运行，容器将在几秒钟内启动，并且您将拥有一个具有 Java 功能的 HBase 实例， REST 和 Thrift API 正在运行。

![](img/00008.jpeg) 注意：此 Docker 命令公开 Zookeeper 的所有端口，HBase 外部 API 和 Web UI。如果它们与您计算机上的其他服务器冲突，您可以通过更改-p 参数上冒号前的数字来更改本地端口。例如，要让 Thrift 监听 Docker 主机上的端口 91 而不是 9090，请使用-p 91：9090。

此映像使用本地文件系统进行 HBase 数据存储，当容器被终止时不会保留，因此您可以使用 docker kill hbase 将数据库重置回原始状态，然后重复 docker run 命令。

## 使用 HBase Shell

HBase 附带一个命令行界面，即 HBase Shell。 Shell 无法在远程计算机上使用，因此您需要从本地计算机（对于 HBase 独立和伪分布式模式）运行它，或者登录到主服务器（对于分布式模式）。

从 HBase bin 目录中，运行 hbase shell 以启动 Shell。如果您通过我的 Docker 镜像运行 HBase，请通过运行代码清单 6 中的交互式命令进行连接：

代码清单 6：在 Docker 中运行 HBase Shell

```
docker exec -it hbase hbase shell

```

HBase Shell 基于 JRuby，您可以使用它来执行脚本文件以及交互式命令。 Shell 中提供了大量命令。它是开始使用 HBase 的理想之地，您还可以在生产中使用它来管理集群。

我们将在本章中介绍定义表和读写数据的主要命令。

## 使用表格

三个 shell 命令将帮助您开始使用新的 HBase 数据库：

· 列表

· 产生

· 描述

要查看数据库中的所有表，运行 list ，您将看到两种形式的输出：作为纯文本列表，以及作为数组表示。代码清单 7 显示了示例输出：

代码清单 7：清单表

```
hbase(main):001:0> list
TABLE                                                                                                                  
api-logs                                                                                                                
social-usage                                                                                                           
2 row(s) in 0.2550 seconds

=> ["api-logs", "social-usage"]

```

列表命令仅提供表名，而不提供其他详细信息。对于大型数据库，您可以通过为命令提供正则表达式来过滤输出，以匹配表名;例如列表'so。*'将显示以'so'开头的表名。

要创建表，请使用 create 命令，指定表名和列系列名称。 （可选）您可以传递列族的配置设置，这是您可以更改 HBase 存储的单元版本数的方法。代码清单 8 显示了两个 create 命令：

代码清单 8：创建表

```
hbase(main):007:0> create 'with-default-config', 'cf1'
0 row(s) in 1.2380 seconds

=> Hbase::Table - with-default-config
hbase(main):008:0> create 'with-custom-config', {NAME =>'cf1', VERSIONS=>3}
0 row(s) in 1.2320 seconds

=> Hbase::Table - with-custom-config

```

表 with-default-config 有一个列族， cf1 ，未指定配置，因此它将使用 HBase 默认值（包括具有单个单元版本）。表 with-custom-config 也有一个名为 cf1 的列族，但具有指定三个单元版本的自定义配置设置。

![](img/00008.jpeg) 注意：HBase Shell 使用 Ruby 语法，用花括号来定义指定为名称 - 值对的对象和属性，用值`'=>'`分隔。

要查看表的配置，请使用 describe 命令。输出告诉您表是否已启用客户端访问，并包括所有列系列及其所有设置，如代码清单 9 所示：

代码清单 9：描述表格

```
hbase(main):009:0> describe 'with-custom-config'
Table with-custom-config is ENABLED                                                                                    
with-custom-config                                                                                                      
COLUMN FAMILIES DESCRIPTION                                                                                            
{NAME => 'cf1', DATA_BLOCK_ENCODING => 'NONE', BLOOMFILTER => 'ROW', REPLICATION_SCOPE => '0', VERSIONS => '3', COMPRESS
ION => 'NONE', MIN_VERSIONS => '0', TTL => 'FOREVER', KEEP_DELETED_CELLS => 'FALSE', BLOCKSIZE => '65536', IN_MEMORY =>
'false', BLOCKCACHE => 'true'}                                                                                          
1 row(s) in 0.1240 seconds

```

现在我们有一些具有不同配置的表，我们可以开始使用 HBase Shell 添加和检索数据。

## 写入细胞值

使用 HBase Shell，可以使用 put 命令为单个单元格写入数据，指定表名，行键，列名和单元格值。代码清单 10 中的命令将 cf1 列族中的数据列的值设置为具有键 rk1 的行的 v1 ：

代码 10：写入数据

```
hbase(main):019:0> put 'with-default-config', 'rk1', 'cf1:data', 'v1'
0 row(s) in 0.0070 seconds

```

put 命令就像插入/更新一样工作。如果该行不存在，则命令将创建该行，创建列并设置单元格值。如果该行存在但列不存在，则该命令会将该列添加到该行并设置单元格值。

使用具有单个单元版本的默认列族配置，如果行和列已存在，则该命令将使用新值覆盖现有值。但是对于具有多个版本的列族， put 命令会添加带有该值的新单元格版本并设置时间戳。

您可以选择指定要使用的自定义时间戳值，作为单元格值之后的长整数。代码清单 11 明确指定了 UNIX 纪元（1970 年 1 月 1 日）过去一毫秒的时间戳：

代码清单 11：使用时间戳写入数据

```
hbase(main):020:0> put 'with-default-config', 'rk1', 'cf1:data', 'v0', 1
0 row(s) in 0.0060 seconds

```

![](img/00009.jpeg)提示。在更新中指定时间戳时要小心。如果您的时间戳早于单元格的其他版本（即使列系列中只配置了一个版本），则假定您的数据比当前数据旧，并且单元格值不会被覆盖 - 并且更新丢失了。

## 阅读数据

使用 get 命令读取行上的数据，但与 put 命令不同，您可以使用 get 读取多个单元格值。要读取整行，请使用获取表名和行键。 HBase 将返回行中每个单元格值的最新版本，如代码清单 12 所示：

代码清单 12：读取整行

```
hbase(main):017:0> get 'social-usage', 'a'
COLUMN                          CELL                                                                                   
 i:tw                           timestamp=1446655378543, value=@EltonStoneman                                          
 t:tw                           timestamp=1446655459639, value=900                                                     
 tw:2015110216                  timestamp=1446655423853, value=310                                                      
 tw:2015110316                  timestamp=1446655409785, value=270                                                     
 tw:2015110417                  timestamp=1446655398909, value=320                                                      
5 row(s) in 0.0360 seconds

```

您可以将结果限制为特定的列或族，并使用逗号分隔的列族名称列表或行键后的限定符。在代码清单 13 中，我们返回整个 i 系列，并且只返回 tw 系列中的一列：

代码清单 13：读取特定列

```
hbase(main):022:0> get 'social-usage', 'a', 'tw:2015110316', 'i'
COLUMN                          CELL                                                                                   
 i:tw                           timestamp=1446655378543, value=@EltonStoneman                                          
 tw:2015110316                  timestamp=1446655409785, value=270
2 row(s) in 0.0090 seconds

```

您还可以传递具有许多属性的对象，而不仅仅是字符串，以从行返回更具体的详细信息。我可以通过指定 VERSIONS 属性返回列的多个版本，并返回要返回的数字，如代码清单 14 所示：

代码清单 14：读取多个单元格版本

```
hbase(main):027:0> get 'with-custom-config', 'rk1', {COLUMN =>'cf1:data', VERSIONS => 3}
COLUMN                          CELL                                                                                   
 cf1:data                       timestamp=1446655931606, value=v3                                                      
 cf1:data                       timestamp=1446655929977, value=v2                                                      
 cf1:data                       timestamp=1446655928221, value=v1                                                      
3 row(s) in 0.0120 seconds

```

## 扫描行

HBase 表中的行按顺序物理存储，按行键排序。我们将在第 9 章“区域服务器内部”中查看数据的结构和索引方法，但是现在，我们只需要知道：

· 排序表表示按键快速直接访问。

· 排序表表示按值搜索速度慢。

实际上，您无法在 HBase 中搜索与任意模式匹配的行键。如果您有一个存储系统访问日志的表，其行键启动 {systemID} | {userID} ，则无法搜索某个特定用户的日志，因为用户 ID 位于行键。

使用 HBase，您可以通过扫描表找到匹配的行，为扫描提供开始和结束边界。从逻辑上讲，HBase 的工作方式与游标类似，将表定位到起始行（或起始行的部分匹配）并读取直到结束行。

扫描命令很简单，但对于 HBase 的新用户来说结果可能是意外的。表 2 显示了我的 access-logs 表中的一些示例数据：

| 行键 |
| 杰里科&#124;戴夫&#124; 201510 |
| 杰里科&#124;埃尔顿&#124; 201510 |
| 杰里科&#124;埃尔顿&#124; 201511 |
| 杰里科&#124;弗雷德&#124; 201510 |

表 2：样本行键

我们在这里有四个行密钥，全部用于名为 Jericho 的系统，用于 Dave，Elton 和 Fred，用于 2015 年 10 月和 11 月。表 2 中的行以相同的字典顺序列出，因为它们存储在 HBase 表。

要查找 Jericho 访问的所有行，我可以使用 STARTROW 值扫描表格，如代码清单 15 所示：

代码清单 15：用 STARTROW 扫描

```
hbase(main):006:0> scan 'access-logs', {STARTROW => 'jericho'}
ROW                             COLUMN+CELL                                                                            
 jericho|dave|201510            column=t:3015, timestamp=1446706437576, value=60                                       
 jericho|elton|201510           column=t:3015, timestamp=1446706444028, value=700                                      
 jericho|elton|201511           column=t:0416, timestamp=1446706449473, value=800                                       
 jericho|fred|201510            column=t:0101, timestamp=1446706454401, value=450                                      
4 row(s) in 0.0540 seconds

```

要查找所有 Elton 访问 Jericho 的信息， STARTROW 需要包含用户 ID，我需要添加 ENDROW 值以排除 Elton 之后的任何行。这是扫描变得更有趣的地方。我可以使用 jericho | f 的 ENDROW 值，这样就可以得到 Elton 的日志，如代码清单 16 所示：

代码清单 16：使用 ENDROW 扫描

```
hbase(main):010:0> scan 'access-logs', {STARTROW => 'jericho|elton', ENDROW => 'jericho|f'}
ROW                             COLUMN+CELL                                                                            
 jericho|elton|201510           column=t:3015, timestamp=1446706444028, value=700                                      
 jericho|elton|201511           column=t:0416, timestamp=1446706449473, value=800                                      
2 row(s) in 0.0190 seconds

```

该查询现在有效，但如果我们稍后为名为 Ernie 的用户添加行，则当我运行相同的查询时，它也将返回其日志。因此扫描的 STARTROW 和 ENDROW 需要尽可能具体，而不会失去查询的灵活性。

将在任何时间段内返回所有 Elton 日志的查询可以使用`STARTROW => 'jericho|elton'`和`ENDROW => 'jericho|elton|x'`。了解您的 ASCII 字符代码在这里有所帮助。

管道字符具有比任何字母数字字符更高的值，因此在用户名之后包括管道确保没有其他用户的日志将进入扫描。字符 x 高于任何数字，因此在扫描结束时添加它意味着查询将返回任何年份的行。

关于扫描的最后一点：上边界是'达到'值，而不是'达到并包括'值。如果我想在 2015 年 10 月和 11 月看到所有 Elton 的访问权限，则代码清单 17 中的查询不正确：

代码清单 17：扫描'向上'到 ENDROW

```
hbase(main):014:0> scan 'access-logs', {STARTROW => 'jericho|elton|201510', ENDROW => 'jericho|elton|201511'}
ROW                             COLUMN+CELL                                                                             
 jericho|elton|201510           column=t:3015, timestamp=1446706444028, value=700                                      
1 row(s) in 0.0140 seconds

```

使用 jericho | elton | 201511 的 ENDROW 值表示 HBase 读取该行然后停止。要包含 201511 中的行，我需要一个比那些行更远的结束行值，在这种情况下我可以使用 jericho | elton | 201512 。

## 摘要

在本章中，我们开始使用 HBase，从 Docker 容器本地运行它。然后我们使用 HBase Shell 连接并使用表管理命令列出数据库中的所有表，创建新表并描述其配置。

我们看到了如何使用 put 命令写入数据，并使用 get 命令读取它，包括使用多个版本的单元格。我们看到了如何扫描一系列行的表，使用开始和结束行键作为扫描边界。

我们将在第 10 章“监视和管理 HBase”中返回 HBase Shell，其中包含更多高级主题。在下一章中，我们将更详细地介绍 HBase 表设计，行键和区域。